/* 1. Почему код дает именно такие результаты? */



let a = 1, b = 1, c, d;
c = ++a; alert(c);              // 2    //c = a + 1 = 1 + 1 = 2                         //c = 2, a = 2
d = b++; alert(d);              // 1    //d = b = 1, b = b + 1 = 2                      //d = 1, b = 2
c = (2 + ++a); alert(c);        // 5    //c = 2 + (a + 1) = 2 + (2 + 1) = 5             //c = 5, a = 3
d = (2 + b++); alert(d);        // 4    //d = 2 + b = 2 + 2 = 4, b = b + 1 = 2 + 1 = 3  //d = 4, b = 3
alert(a);                       // 3    //a = a + ++a + ++a = 1 + 1 + 1 = 3
alert(b);                       // 3    //b = b + b++ + b++ = 1 + 1 + 1 = 3

/* Надеюсь такое объяснение достаточно) */
